console.log(`

    5.5 小结

        JavaScript 中的对线称为引用值，集中内置的引用类型可用于创建特定类型的对线。
        · 引用值与传统面向对象编程语言中的类相似，但实现不同
        · Date 类型提供关于 日期 和时间的信息，包括当前日期、时间和相关计算
        · RegExp 类型是 ECMAScript 支持正则表达式的接口，提供了大多数基础和部分高级的
    正则表达式功能。
        
        JavaScript 比较独特的一点是，函数实际上是 Function 类型的实例，也就是说函数
    也是对象。因为函数也是对象，所以函数页游方法，可用于增强其能力。
        由于原始值包装类型的存在，JavaSCript 中的原始值可以被当成对象来使用。
    有 3 种原始包装类型：Boolean、Number 和 String。它们都具备如下特点。

        · 每种包装类型都映射到同名的原始类型。
        · 以读模式访问原始值时，后台会实例化一个原始值包装类型的对象，借助这个
    对象可以操作相应的数据。
        · 涉及原始值的语句执行完毕后，包装对象会被销毁。

        当代码开始执行时，全局上下文种会存在两个内置对象：Global 和 Math。其中
    Gloabl 对象在大多数 ECMAScript 实现中无法直接访问。不过，浏览器将其实现为 window 对象。
    所有全局变量和函数都是 Global 对象的属性。Math 对象包含辅助完成复杂计算的属性和方法。

    `);
