console.log(`
    
        1.2.3 BOM

        浏览器对象模型（BOM）API，用于支持访问和操作浏览器的窗口。使用
    BOM，开发者可以操控浏览器显示页面之外的部分。HTML5 这个版本以正式
    规范的形式涵盖了尽可能的 BOM 特性。

        总体来说，BOM 主要针对浏览器窗口和子窗口（frame），不过人们通常
    会把任何特定于浏览器的扩展都归在 BOmb 的范畴内，比如：
            · 弹出新浏览器窗口的能力
            · 移动、缩放和关闭浏览器窗口的能力
            · navigator 对象，提供关于浏览器的详尽信息
            · location 对象，提供浏览器加载页面的详尽信息
            · screen 对象，提供关于用于屏幕分辨率的详尽信息
            · performance 对象，提供浏览器内存占用、导航行为和事件统计
    的详尽信息。
            · 对 cookie 的支持
            · 其他自定义对象，如 XMLHttpRequest 和 IE 的 ActiveXObject。


    `);