console.log(`

    4.4 小结
    
        JavaScript可以保存两种类型的值：原始值和引用值。原始值可能是以下
    7 种数据类型之一：Undefined、Null、Boolean、Number、BigInt、String、
    Symbol。 原始值和引用值有以下特点：
        · 原始值大小固定，因此保存在栈内存上。
        · 从一个变量到另一个变量复制原始值会创建该值的第二个副本。
        · 引用值是对象，存储在堆内存上。
        · 包含引用值的变量实际上只包含指向对象的一个指针，而不是对象本身
        · typeof 操作符可以确定值的原始类型，而 instanceof 操作符用于
    确保值的引用类型。
    
    
        任何变量（不管包含的是原始值还是引用值）都存在于某个执行
    上下文中（也称为作用域——。这个上下文（作用域）决定了变量的生命周期，
    以及它们可以访问代码的哪些部分。执行上下文可以总结如下：
        · 执行上下文分全局上下文、函数上下文和块级上下文。
        · 代码执行流每进入一个新上下文，都会创建一个作用域链，用于搜索变量和函数。
        · 函数或块的局部上下文不仅可以访问自己作用域内的变量，也可以访问包含
    任何上下文乃至全局上下文中的变量。
        · 全局上下文只能访问全局上下文中的变量和函数，不能直接访问局部上下文中的
    任何数据。
        · 变量的执行上下文用于确定什么时候释放内存。


        JavaScript是使用垃圾回收的编程语言，开发者不需要操心内存分配和回收。
    JavaScript 的垃圾回收程序可以总结如下：
        · 离开作用域的值会被自动标记为可回收，然后在垃圾回收期间被删除。
        · 主流的垃圾回收算法是标记清理，即先给当前不适用的值加上标记，再
    回来回收它们的内存。
        · 引用计数是另一种垃圾回收策略，需要记录值被引用多少次。JavaScript
    引擎不再使用这种算法，但某些旧版本的 IE 仍然会受到这种算法的影响，原因
    是 JavaScript 会访问非原生 JavaScript 对象。
        · 引用计数在代码中存在循环引用时会出现问题。
        · 解除变量的引用不仅可以消除循环引用，而且也对垃圾回收页游帮主。
    为了促进内存回收，全局对象、全局对象的属性和循环引用都应该在不需要时
    解除引用。

`);
